#### Ordinal number Encoding

In ordinal encoding, each unique category value is assigned an integer value. For example, “ red ” is 1, “ green ” is 2, and “ blue ” is 3. This is called an ordinal encoding or an integer encoding and is easily reversible. Often, integer values starting at zero are used.

In [14]:
import datetime
import calendar

In [15]:
today_date = datetime.datetime.today()

In [16]:
today_date

datetime.datetime(2022, 4, 16, 23, 27, 25, 515610)

In [17]:
today_date - datetime.timedelta(1)

datetime.datetime(2022, 4, 15, 23, 27, 25, 515610)

In [18]:
#### List comprehension
days = [today_date - datetime.timedelta(x) for x in range(0,15)]
days

[datetime.datetime(2022, 4, 16, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 15, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 14, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 13, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 12, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 11, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 10, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 9, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 8, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 7, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 6, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 5, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 4, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 3, 23, 27, 25, 515610),
 datetime.datetime(2022, 4, 2, 23, 27, 25, 515610)]

In [19]:
import pandas as pd

In [20]:
data = pd.DataFrame(days)
data.columns=["Day"]

In [21]:
data.head()

                         Day
0 2022-04-16 23:27:25.515610
1 2022-04-15 23:27:25.515610
2 2022-04-14 23:27:25.515610
3 2022-04-13 23:27:25.515610
4 2022-04-12 23:27:25.515610

In [22]:
data['weekday']=data['Day'].dt.day_name()
data.head()

                         Day    weekday
0 2022-04-16 23:27:25.515610   Saturday
1 2022-04-15 23:27:25.515610     Friday
2 2022-04-14 23:27:25.515610   Thursday
3 2022-04-13 23:27:25.515610  Wednesday
4 2022-04-12 23:27:25.515610    Tuesday

In [23]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7
           
}

In [24]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [25]:
data["weekday_ordinal"] = data["weekday"].map(dictionary)

In [26]:
data

                          Day    weekday  weekday_ordinal
0  2022-04-16 23:27:25.515610   Saturday                6
1  2022-04-15 23:27:25.515610     Friday                5
2  2022-04-14 23:27:25.515610   Thursday                4
3  2022-04-13 23:27:25.515610  Wednesday                3
4  2022-04-12 23:27:25.515610    Tuesday                2
5  2022-04-11 23:27:25.515610     Monday                1
6  2022-04-10 23:27:25.515610     Sunday                7
7  2022-04-09 23:27:25.515610   Saturday                6
8  2022-04-08 23:27:25.515610     Friday                5
9  2022-04-07 23:27:25.515610   Thursday                4
10 2022-04-06 23:27:25.515610  Wednesday                3
11 2022-04-05 23:27:25.515610    Tuesday                2
12 2022-04-04 23:27:25.515610     Monday                1
13 2022-04-03 23:27:25.515610     Sunday                7
14 2022-04-02 23:27:25.515610   Saturday                6

#### Count or frequency encoding

In [6]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)

train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [7]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [8]:
column=[1,3,5,6,7,8,9,13]

In [9]:
train_set = train_set[column]

In [10]:
train_set.columns = ['Employement','Degree','Status','Designation','Family_job','Race','Sex','Country']

In [11]:
train_set.head()

,Employement,Degree,Status,Designation,Family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [12]:
for feature in train_set.columns[:]:
    print(feature,':',len(train_set[feature].unique()),'labels')

Employement : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
Family_job : 6 labels
Race : 5 labels
Sex : 2 labels
Country : 42 labels

In [12]:
country_map = train_set["Country"].value_counts().to_dict()
country_map

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Laos': 18,
 ' Thailand': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [13]:
train_set.Country = train_set.Country.map(country_map)
train_set.head(20)

,Employement,Degree,Status,Designation,Family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
5,Private,Masters,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170
6,Private,9th,Married-spouse-absent,Other-service,Not-in-family,Black,Female,81
7,Self-emp-not-inc,HS-grad,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
8,Private,Masters,Never-married,Prof-specialty,Not-in-family,White,Female,29170
9,Private,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
10,Private,Some-college,Married-civ-spouse,Exec-managerial,Husband,Black,Male,29170
11,State-gov,Bachelors,Married-civ-spouse,Prof-specialty,Husband,Asian-Pac-Islander,Male,100
12,Private,Bachelors,Never-married,Adm-clerical,Own-child,White,Female,29170
13,Private,Assoc-acdm,Never-married,Sales,Not-in-family,Black,Male,29170
14,Private,Assoc-voc,Married-civ-spouse,Craft-repair,Husband,Asian-Pac-Islander,Male,583
15,Private,7th-8th,Married-civ-spouse,Transport-moving,Husband,Amer-Indian-Eskimo,Male,643
16,Self-emp-not-inc,HS-grad,Never-married,Farming-fishing,Own-child,White,Male,29170
17,Private,HS-grad,Never-married,Machine-op-inspct,Unmarried,White,Male,29170
18,Private,11th,Married-civ-spouse,Sales,Husband,White,Male,29170
19,Self-emp-not-inc,Masters,Divorced,Exec-managerial,Unmarried,White,Female,29170

#### Advantages
1. Easy To Use
2. Not increasing feature space 

#### Disadvantages
1. It will provide same weight if the frequencies are same

#### Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [14]:
import pandas as pd
df = pd.read_csv('titanic.csv', usecols=["Cabin","Survived"])

In [15]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [16]:
df["Cabin"].fillna('Missing', inplace=True)

In [17]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [18]:
# Taking first letter in the column
df['Cabin'] = df['Cabin'].astype(str).str[0]

In [19]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [20]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [22]:
ordinal_labels = df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [32]:
enumerate(ordinal_labels,0)

In [33]:
ordinal_labels2 = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [34]:
df['Cabin_ordinal_labels'] = df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

#### Mean Encoding

In [35]:
mean_ordinal = df.groupby(['Cabin'])['Survived'].mean().sort_values().to_dict()
mean_ordinal

{'T': 0.0,
 'M': 0.29985443959243085,
 'A': 0.4666666666666667,
 'G': 0.5,
 'C': 0.5932203389830508,
 'F': 0.6153846153846154,
 'B': 0.7446808510638298,
 'E': 0.75,
 'D': 0.7575757575757576}

In [36]:
df['mean_ordinal_encode'] = df.Cabin.map(mean_ordinal)

In [37]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  mean_ordinal_encode
0         0     M                     1             0.299854
1         1     C                     4             0.593220
2         1     M                     1             0.299854
3         1     C                     4             0.593220
4         0     M                     1             0.299854